{
  "navigation": {
    "home": "HOME",
    "about": "ABOUT",
    "blog": "BLOG",
    "portfolio": "PORTFOLIO",
    "contact": "CONTACT",
    "dark_mode": "DARK MODE",
    "light_mode": "LIGHT MODE"
  },
  "home": {
    "title": "DEDEARD | WEB DEVELOPER",
    "app_name": "DEDEARD",
    "app_title": "Web developer based in Makassar, Indonesia.",
    "bg_url": "https://i.ibb.co/c8RLgXS/main.jpg",
    "socials": [
      {
        "label": "INSTAGRAM",
        "url": "https://www.instagram.com/dedeard.js/"
      },
      {
        "label": "GITHUB",
        "url": "https://github.com/dedeardiansya"
      },
      {
        "label": "WHATSAPP",
        "url": "https://api.whatsapp.com/send?phone=6281343912883&text=%3CChatMe%20%2F%3E"
      }
    ]
  },
  "about": {
    "label": "About.",
    "title": "ABOUT | WEB DEVELOPER",
    "heading": "I’m Dede Ardiansya",
    "body": "<p>Web developer based in Makassar, Indonesia.</p><p>Building websites is my hobby, I try to have a minimalist website design.</p>",
    "img_url": "https://i.ibb.co/3vzGh4G/dede.jpg",
    "id": {
      "heading": "Saya Dede Ardiansya",
      "body": "<p>Pengembang web yang berbasis di Makassar, Indonesia.</p><p>Membangun website adalah hobi saya, saya mencoba memiliki desain website yang minimalis.</p>"
    }
  },
  "portfolio": {
    "label": "Portfolio.",
    "title": "PORTFOLIO | WEB DEVELOPER",
    "items": [
      {
        "type": "Laravel",
        "text": "Disposisi surat",
        "url": "https://github.com/dedeardiansya/deposisi-surat",
        "img": "https://i.ibb.co/G23WQVq/Untitled-1.jpg"
      },
      {
        "type": "Laravel | Nuxt.js",
        "text": "Ajarbelajar",
        "url": "https://ab.dedeard.my.id/",
        "img": "https://i.ibb.co/DVj3dyV/ajarbelajar.jpg"
      },
      {
        "type": "Vue",
        "text": "Web Portfolio",
        "url": "https://demodedeard.web.app/",
        "img": "https://i.ibb.co/kKZRB9g/dedeard.jpg"
      }
    ]
  },
  "contact": {
    "label": "Contact.",
    "title": "CONTACT | WEB DEVELOPER",
    "info": [
      {
        "label": "ADDRESS STREET",
        "items": [
          "D/23 Perumahan Puri diva Istanbul.",
          "Gowa, Sulawesi Selatan."
        ]
      },
      {
        "label": "MOBILE PHONE",
        "items": [
          "Call: +62 813-4391-2883",
          "WhatsApp: +62 813-4391-2883"
        ]
      },
      {
        "label": "ADDRESS EMAIL",
        "items": [
          "me@dedeard.my.id"
        ]
      }
    ],
    "form_url": "https://formspree.io/f/xoqyaqqe"
  },
  "blog": {
    "label": "Blog.",
    "title": "BLOG | WEB DEVELOPER",
    "items": [
      {
        "title": "Filsafat Teknologi. #2 Konsepualisasi Filsafat teknologi.",
        "slug": "filsafat-teknologi-2-konsepualisasi-filsafat-teknologi",
        "img": "https://i.ibb.co/C5wtBtf/photo-1526374965328-7f61d4dc18c5.jpg",
        "category": "Common",
        "created_at": "2021-07-07",
        "body": "<p id=\"isPasted\">Jadi teknologi itu berasal dari kata Yunani, Techne. Artinya adalah Tidak hanya menciptakan sesuatu, tapi berkaitan dengan seni berfikir. Jadi ada seni disana. Seni mengimajinasikan apa yang ingin kita ciptakan.</p><p>Sebenarnya kita harus menggaris bawahi dulu kata &#39;cipta&#39;. Jadi ada 2 kata yang harus kita bisa bedakan, pertama adalah kata Poiesis artinya mencipta dari yang tidak ada menjadi ada, disana itu ada keterlibatan manusia, ada keterlibatan sebab efisien yang mengadakan sesuatu itu. Contohnya seperti software, hardware. Itu sesuatu yang kita buat.</p><p>Nah sedangkan kata kedua adalah Physis artinya, ada karena sendirinya. Ada secara natural -- alamiah. Seperti tumbuh tumbuhan.</p><p>Nah jadi Techne ini adalah ruang lingkup poesis yang lebih luas.</p><p>Karena Techne ini berkaitan tentang menciptakan sesuatu dari yang tidak ada menjadi ada. Maka sebenarnya, techne ini berhubungan langsung terhadap penyingkapan kita. Jadi techne ini berkaitan tentang epistem, yaa walaupun ranah daripadanya berbeda.</p><p>Kalo misalnya epstemologi ranahnya teoritik, sementara techne ini ranah nya praksis. Jadi kata techne ini yang menjadi dasar dari perkembangan berikutnya, hingga kita menyebutnya technologi.</p><p>Tapi mungkin kita bisa melihat perbedaan teche yang era klasik dan techne di era kita sekarang.</p><p>Salahsatu perbedaanya jika misalnya techne untuk mengekspresikan pikiran sementara,sedangkan teknologi untuk mengeksploitasi alam.</p><p>Nah para filusuf dan pemikir era modern ini memberikan persepsinya terhadap eksploitatif alam. Misalnya kaya francis bacon yang bilang &quot;ilmu pengetahuan adalah kekuasaan&quot;. Jadi kalo misalnya dari sana, bisa dikatakan, manusia menganggap semeta alam adalah objek.</p><p>itu mungkin tentang Konsepualisasi Filsafat teknologi.</p><p>Selanjutnya, bagaimana hubungan antara filsafat science dan teknologi ?</p>"
      },
      {
        "title": "Filsafat Teknologi. #1 Apa itu Filsafat Teknologi?",
        "slug": "filsafat-teknologi-1-apa-itu-filsafat-teknologi",
        "img": "https://i.ibb.co/C5wtBtf/photo-1526374965328-7f61d4dc18c5.jpg",
        "category": "Common",
        "created_at": "2021-07-06",
        "body": "<p>Pada dasarnya, Teknologi membuat segala sesuatu itu berubah. Seperti mungkin sudut pandang kita pada waktu dan ruang berubah. Atau bahkan karena teknologi sudut pandang pada diri kitapun berubah.</p><p><strong>Apa itu Filsafat Teknologi ?</strong></p><p>Filsafat teknologi adalah salahsatu cabang dari filsafat kontemporer/Contemporary philosophy kurang lebih sekitar tahun 1970an. Sebenarnya kemuncunlannya ada yang bilang bisa dikatakan terlambat. Karena sebenarnya, teknologi udah berkembang pesat pada abad 15.</p><p>Pertanyaannya, <strong>kenapa bisa terlambat ?</strong>.</p><p>Dulu orang orang beranggapan teknologi dipandang sebagai hal yang negatif. dan teknologi berasosiasi dengan tindak eksploitasi baik pada alam semesta maupun manusia.</p><p>Yang kedua teknologi ternyata melibatkan banyak disiplin ilmu pengetahuan. Seperti antropologi, politik, dan tentunya filsafat science itu sendiri. Karena itu harus memerlukan konsolidasi untuk menjadi satu kajian yang terpisah dari berbagai filsafat kontemporer.</p><p>Orang orang yang berpengaruh di filsafat teknologi siapa saja ?</p><ul><li>Martin Heidegger, Pemikir dari jerman</li><li>Don Ihde, Pemikir dari Amerika</li><li>Jaques Ellul, Seorang filusuf francis</li></ul><p>Orang orang diatas ini membuat kajian spesifik tentang teknologi.</p><p>Jika kita pilah pilah, apa saja sih yang ada pada kajian filsafat teknologi ?</p><ul><li>Konsepualisasi Filsafat teknologi,</li><li>Relasi antara filsafat science dan teknologi,</li><li>Persepsi atau sudut pandang manusia akibat teknologi,</li><li>Relasi antara teknologi dengan manusia.</li></ul>"
      },
      {
        "title": "Jangan Ngoding Terus",
        "slug": "jangan-ngoding-terus",
        "img": "https://i.ibb.co/n7P7twm/randypodcast-1.png",
        "category": "Common",
        "created_at": "2021-07-05",
        "body": "<p id=\"isPasted\">Jangan Ngoding terus, ada banyak hal yang kamu harus kuasai diluar ngoding,</p><p>Sepintar pintarnya, sehebat hebatnya kamu ngoding, engga akan kepake, jika engga memperhatikan poin poin ini.</p><p>Pertama, adalah komunikasi. Tidak hanya hebat berkomunikasi dengan komputer, dengan beragam bahasa pemrogramannya, kamu yang pada hakikatnya adalah manusia sosial, sangat dituntut harus bisa berkomunikasi dengan manusia lainnya. Karena, komunikasi sangat lah penting.</p><p>Di dunia kerja sendiri, baik itu kerja di instansi, ataupun sebagai kerja freelancer, komunikasi dibutuhkan untuk bekerja sama dengan client. Tentunya komunikasi yang baik, akan menghasilkan feedback yang baik. Komunikasi lainnya adalah, ketika kamu ingin mempromosikan suatu produk buatan sendiri, mau orang orang pake produknya gimana, kalo misalnya kamu engga bisa berkomunikasi dengan baik.</p><p>Sekali lagi, Tentunya komunikasi yang baik, akan menghasilkan feedback yang baik.</p><p>Yang kedua, adalah sikap disiplin, banyak programmer yang selalu dikejar deadline, dan bahkan di hari deadlinenya, project tersebut masih keteteran. Kamu harus tetap disiplin. Khusus nya jika sebagai programmer, harus belajar tentang manajemen projek, salahsatu didalam nya, ada manajemen waktu.</p><p>Ketika diberi deadline, kita ambil contoh, deadline kamu hanya di beri waktu 2 minggu. Disana, sebelum mengerjakan project, buatlah project tersebut ke bagian bagian kecil. Kemudian, tinggal perkirakan atau buat patokan,</p><p>&ldquo; oke, untuk bagian A, saya kerjakan 2 hari, untuk bagian B, pasti beres 1 hari juga &ldquo;.</p><p>Ketika H-1 sebelum deadline, project kamu diharapkan telah selesai, 1 hari tersisa tersebut, tinggal pikirkan, bagaimana kamu pempersentasikan project ke client.</p><p>Dengan begitu, disiplin membuat kita menjadi lebih tenang di akhir, sehingga hasilnya akan memuaskan client, dan kamu juga.</p><p>Yang ketiga, adalah berani mengambil resiko. Jangan menjadi penakut untuk mengambil resiko, jika kamu ingin berkembang menjadi lebih baik, harus bisa mengambil resiko, tak apa jika gagal, karena kegagalan itu potongan potongan puzzle kesuksesan.</p><p>Artinya, berani mengambil resiko sama dengan berani bertanggung jawab. Jangan menjadi, resiko yang kamu ambil, jadi beban berat bagi diri sendiri. Jadikanlah hal itu menjadi bagian dari kamu, dibawa santai dan pikirkan hal kedepannya.</p><p>Tentu, jika semua resiko yang di ambil dengan berani dan siap, kamu akan membuahkan hasil yang positif juga.</p><p>Yang keempat, adalah jaga pola tidur, hal identik dari seorang programmer adalah begadang, seperti, kata rhoma irama, musisi dangdut legendaris indonesia, &ldquo; jangan begadang kalo tidak ada artinya &ldquo;, dan saya pun sangat tidak menyarankan kamu untuk begadang.</p><p>Programmer juga, harus menjaga kesehatan fisiknya, tidur, dianjurkan 6&ndash;8 Jam sehari, karena otak kita membutuhkan istirahat yang cukup, bersamaan dengan seluruh tubuh kita yang lain juga.</p><p>Karena, jika kamu kurang tidur, kamu akan kehilangan fokus, dan bisa mempengaruhi pekerjaan atau project yang dikerjakan, itu dampak buat diri sendiri, namun, gimana kalo misalnya kamu bekerja dalam tim, ketidakfokusan, akan berdampak fatal pada pekerjaan project tim.</p><p>Jadi jagalah fisik, terutama pola tidur.</p><p>Itu adalah beberapa poin yang kamu harus perhatikan, sekali lagi, jangan ngoding terus.</p><p>Banyak diluar sana, programer programer yang pasif, yang tidak memperhatikan poin poin diatas dengan baik, alhasil, mereka kesulitan untuk menghidupi kebutuhannya, atau bahkan hingga keluarganya.</p>"
      },
      {
        "title": "Tips menulis artikel atau tutorial tentang programming",
        "slug": "tips-menulis-artikel-atau-tutorial-tentang-programming",
        "img": "https://i.ibb.co/zNnDFnM/fromunsplash.png",
        "category": "Common",
        "created_at": "2021-07-05",
        "body": "<p id=\"isPasted\">Hai semuanya! untuk teman-teman yang suka berbagi ilmu, tentu media menulis sudah tidak asing lagi. Media pencari populer pun sampai saat ini pun masih berbasis text atau tulisan. Jadi wajar saja kalau kita masih terus memanfaatkan media tulisan seperti blog atau artikel untuk berbagi, termasuk untuk teman-teman di dunia programming.</p><p>Saya ada beberapa tips yang bisa kamu coba, jangan sungkan untuk membagikan apa yang sudah kamu dapatkan selama ini dan terlewatkan di sini.</p><p>&nbsp;</p><p>Memilih topik yang ingin dibahas</p><p>Seringkali saat mengobrol atau menulis, tanpa sadar kita terlalu banyak membahas sesuatu, orang yang membaca pun akhirnya tidak fokus. Sangat penting untuk kamu menentukan poin-poin apa sebenarnya inti dari tulisanmu. Jangan terbawa suasana. Jika terlalu panjang kamu bisa membaginya ke beberapa artikel. Jika pendek, itu semakin bagus, karena kebanyak orang pun ingin mencari &quot;inti&quot; dari pertanyaan yang ingin dia jawab.</p><p>&nbsp;</p><p>Mengetahui level target pembaca</p><p>Jika tidak mengetahui target pembaca sebenarnya, akhirnya kita akan membuat konten yang &quot;terlalu mudah atau terlalu susah&quot; untuk salah satu pihak. Atau yang sering terjadi, kamu menjadi membahas sesuatu dari awal (dari sangat dasar) padahal poin dari artikel kamu bukan hal tersebut.</p><p>Sebagai contoh kamu ingin mengajarkan bagaimana membuat sistem drag dan drop gambar dengan javascript. Tapi kamu selalu menulis &quot;jika kamu tidak tahu apa itu javascript&quot; atau &quot;kalau kamu belum tahu apa itu event, event adalah....&quot;. Akhirnya kita menjelaskan semuanya dari awal lagi. Padahal bukan itu poinnya. Bikin asumsi di awal, siapa yang ingin kamu ajarkan, apakah orang yang sudah mengerti javascript? atau yang belum. Sehingga kamu tidak kehilangan pembaca di tengah jalan.</p><p>&nbsp;</p><p>Membagikan kode jika perlu</p><p>Artikel yang membahas seputar teknikal kode, jangan lupa menyelipkan kode agar bisa dilihat langsung. Menjelaskan hal yang teknikal tanpa memperlihatkan kode aslinya akan sulit untuk dicerna.</p><p>Sebagai contoh kita mau membahas &quot;fungsi drag dan drop javascript&quot;, maka saya akan memperlihatkan kodenya seperti ini misalnya:</p><p>function&nbsp;drop(ev)&nbsp;{</p><p>&nbsp; ev.preventDefault();</p><p>&nbsp; var data = ev.dataTransfer.getData(&quot;text&quot;);</p><p>&nbsp; ev.target.appendChild(document.getElementById(data));</p><p>}</p><p>&nbsp;</p><p>Memberikan analogi sederhana</p><p>Tidak semua konsep yang ada di programming mudah dipahami begitu saja. Untuk membantu orang lain mencernanya, berikan analogi atau permisalan sederhana.</p><p>Sebagai contoh kita ingin mengenalkan konsep array. Kita bisa bilang &ldquo;bayangkan ada beberapa kotak&rdquo;, sehingga pembaca atau penonton bisa membayangkan &ldquo;oh.. array ini seperti tempat penyimpanan&rdquo;</p><p>Pastikan memberi contoh yang memang mudah dipahami, jangan sebaliknya justru semakin membuatnya kompleks</p><p>&nbsp;</p><p>Jangan takut berbagi</p><p>Apa yang menurut kamu sudah jelas, belum tentu untuk orang lain.</p><p>Apa yang menurut kamu mudah, bisa jadi sulit untuk orang lain.</p><p>Jangan malu atau takut membagikan apa yang kamu tahu.</p><p>Mengajar atau berbagi bukan sok pintar,</p><p>justru sebaliknya,</p><p>dengan berbagi kita siap menerima masukan dan belajar dari orang lain</p><p>Selamat menulis dan berkarya!</p>"
      },
      {
        "title": "Belajar ketika project? Atau belajar dulu baru ngebuat project?",
        "slug": "belajar-ketika-project-atau-belajar-dulu-baru-ngebuat-project",
        "img": "https://i.ibb.co/3TDtdZ2/Belajar-ketika-project-Atau-belajar-dulu-baru-ngebuat-project.png",
        "category": "Common",
        "created_at": "2021-07-05",
        "body": "<p>Belajar Ketika Project, artinya, kamu memiliki tekad dan motivasi yang tinggi disini. Positif dari belajar ketika project adalah kamu langsung terjun ke studikasus yang ada. Yang kamu garap. Belajar sesuai kebutuhan, itu poinnya. Kamu memutuskan untuk belajar hal hal yang diperlukan sesuai studikasus. Dengan kata lain, kamu engga harus belajar segala hal. Bagus ? Tentu bagus.</p><p>Positifnya lagi, kamu akan terbiasa menangani permasalahan dengan metode pemecahannya. Terpaksa, dipaksa, dan terbiasa.</p><p>Namun permasalahan belajar ketika project adalah, kamu lupa poin poin lain, kamu engga pelajari itu. Statementnya mungkin bertolak belakang dari nilai positifnya. Tapi mungkin inilah kerugian yang didapat ketika belajar ketika project. Jika diperumpamakan, Belajar ketika project adalah,</p><blockquote><p>kamu Langsung terjun bertahan hidup di sebuah hutan yang engga dikenal, Tapi engga punya apa apa.</p></blockquote><p>Selanjutnya, Belajar dulu baru ngebuat project. Ini mungkin yang biasa ada di sistem pendidikan Indonesia, anggaplah seorang mahasiswa. Mahasiswa di didik untuk belajar dulu keseluruhan basic/dasar dari suatu hal. Ini menjadikan ilmu yang didapat menjadi pondasi kedepannya. Kemudian dengan belajar terlebih dahulu, Kamu akan siap untuk mengerjakan project.</p><p>Namun permasalahan dari metode ini, kamu awalnya akan kaget karena tidak terbiasa dengan studikasus, mental yang dipertaruhkan disini, kamu akan kesusahan diawal. nah jika diperumpamakan, belajar dulu baru ngebuat project adalah,</p><blockquote><p>kamu Langsung terjun bertahan hidup di sebuah hutan yang engga dikenal, Tapi sudah punya bekal yang cukup.</p></blockquote><p>Jadi manakah yang lebih baik ? Belajar ketika project ? Atau belajar dulu baru ngebuat project ?</p><p>Jawabannya adalah satukan semuanya. Belajar lah dengan project dari dasar. Buat segala macam studikasus diiringi dengan belajar kamu. Engga usah ngebuat project besar, buat project kecil yang tentunya akan membesar.</p><p>Sebenarnya ada langkah awal untuk membuat project, Tentunya, tentukan dulu apa yang akan kamu buat. Jika kata bang Hilman, Tentukan tujuan dulu. Dari sana kamu tinggal buat roadmap project dan diiringi pembelajaran kamu.</p><p>Ambil contoh, Kamu akan buat website pribadi, disana kamu pasti akan belajar dulu HTML, kemudian CSS, kemudian JavaScript, dan seterusnya hingga websitenya di hosting di internet. Belajar seperti inilah yang produktif. Engga ada ilmu yang akan sia sia kamu pelajari disini.</p><p>Bagaimana cara belajar kamu sekarang ?</p>"
      },
      {
        "title": "Penting nggak sih memilih kombinasi warna website?",
        "slug": "penting-nggak-sih-memilih-kombinasi-warna-website",
        "img": "https://i.ibb.co/qmQkXKS/Kenapa-Go-Bisa-Populer-2.jpg",
        "category": "Design",
        "created_at": "2021-07-05",
        "body": "<p id=\"isPasted\">Ya tentunya penting dong. Apalagi jika sudah membuat brand, memilih kombinasi warna website yang sesuai dengan personalitas brand merupakan sebuah keharusan, agar para customer atau pembaca akan lebih mudah mengenali dan mengingat suatu brand.</p><p>Tidak hanya itu, manfaat memilih kombinasi warna yang tepat adalah warna website bisa menentukan kesan pertama pengunjung. Jadi hati-hati dalam memilih dan menempatkan warna.</p><p>1. Pilih primary color</p><p>Pilih warna yang sesuai Brand atau tema website dan sesuai dengan namanya yaitu primary color. Usahakan warna utama ini harus lebih menonjol atau dominan.</p><p>2. Pilih satu atau dua warna tambahan yang melengkapi warna</p><p>Hanya menggunakan primary color saja tidak cukup. Anda perlu memilih warna lain agar penampilan website tidak terlihat membosankan. Cara yang paling direkomendasikan adalah memilih a triadic color scheme atau kombinasi tiga warna. Untuk melakukannya Anda dapat mengikuti 60-30-10 rule, yakni:</p><p>-60% warna utama (primary color)</p><p>-30% warna sekunder (secondary color)</p><p>-10% warna aksen (accent color)</p><p>3. Tambahkan warna netral</p><p>Warna netral adalah salah satu komponen penting dalam website, yang dimana berfungsi untuk membuat teks lebih terbaca dan menjaga keseimbangan antara element - element dalam suatu website (teks, gambar, animasi, dan sebagainya)</p><p>4. Pilih warna untuk latar belakang situs web</p><p>Ini adalah tips penting, karena latar belakang situs web Anda secara teoritis akan memakan lebih banyak ruang daripada warna lain. Anda bisa menggunakan latar abu-abu halus untuk lebih menyejukan mata, bisa juga menggunakan warna putih seperti website pada umumnya. Atau jika ingin menggunakan tema gelap, Anda boleh menggunakan latar berwarna hitam.</p><p>5. Pertimbangkan aspek psikologi warna</p><p>Jika belum memiliki brand Anda disarankan mempertimbangkan aspek psikologi warna. Sadar atau tidak, warna juga turut menyumbang pengaruh signifikan terhadap pemikiran seseorang. Maka dari itu Anda bisa menggunakan teknik psikologi warna untuk menarik lebih banyak pengguna.</p><p>Dan untuk mencari warna, Anda bisa menggunakan online tools seperti color picker atau bisa mengunjungi website seperti <a href=\"https://brandcolors.net\">https://brandcolors.net</a> atau <a href=\"https://coolors.co/\">https://coolors.co/</a></p>"
      },
      {
        "title": "Apa itu static site generator",
        "slug": "apa-itu-static-site-generator",
        "img": "https://i.ibb.co/ByLSFwp/ssg.jpg",
        "category": "SSG",
        "created_at": "2021-06-25",
        "body": "<p>Ada banyak jalan untuk sampai ke Roma, begitu juga dengan membuat website, ada banyak cara untuk melakukannya. Salah satu tren saat ini adalah membuat website dengan static site generator atau yang dikenal dengan SSG.</p><p>Static Site Generator adalah tool yang akan membantu kita mengubah website yang dibangun menjadi file file statis HTML, CSS dan Javascript untuk dikonsumsi oleh penggunanya&nbsp; nanti.</p><h2>Apa itu static site generator</h2><p>Kalau diartikan langsung, SSG bisa disebut &quot;penghasil website statis&quot;. Pada dasarnya SSG adalah istilah umum untuk sebuah alat atau software yang bisa menghasilkan halaman statis.</p><p>Apa sih halaman statis? halaman statis adalah halaman yang terbuat dari tiga teknologi andalan web developer yaitu.. HTML, CSS dan javascript (pilihan), di mana tidak ada backend ataupun database yang terlibat langsung di sini.</p><h2>Apa manfaat website statis</h2><p>Hal yang wajar ditanyakan, apa sih manfaat dari membuat website dengan SSG ini? terutama dengan berabagai macam pilihan bahasa program saat ini.</p><p><strong>Lebih Cepat</strong></p><p>Dengan menggunakan website statis saja, artinya kita tidak lagi melakukan &quot;request&quot; ke backend, karena hanya memanggil halaman itu saja. Coba bandingkan saat kamu membuat satu file index.html dan website lain dengan konten yang sama yang menggunakan bahasa backend tertentu, tentu website yang dibuat dengan index.html saja bisa berjalan lebih cepat.</p><p><strong>Lebih Aman</strong></p><p>Karena tidak banyak kode yang berhubungan dengan data atau backend, maka ada banyak celah keamanan yang secara automatis terpangkas alias membuat website kamu lebih aman.</p><p><strong>Hosting Gratis</strong></p><p>Mempublish website dinamis lebih sulit dibanding website dinamis. Penyedia hosting statis yang gratis pun lebih banyak. Nah keuntungan untuk kamu yang memilih SSG, kamu justru akan bingung (bingung yang baik) dengan banyaknya pilihan hosting halaman statis gratis untuk kamu nanti.</p><h2>Website seperti apa yang cocok menggunakan SSG?</h2><p>Website yang bersifat <strong>tidak memiliki&nbsp;</strong>&quot;user generated content&quot; alias konten yang tidak dibuat oleh user penggunanya. Sebagai contoh website forum, punya banyak pertanyaan yang dibuat oleh user. Meskipun kalau mau &quot;memaksakan&quot; pasti akan ada jalan, tapi sifat dasar dari website ssg ini tidak cocok untuk itu.</p><p>Jadi selain dari hal tersebut seperti website pribadi, membuat blog, profil perusahaan, cocok cocok saja.</p><h2>Apa teknologi dibalik SSG?</h2><p>Kita biasanya perlu menginstall program untuk menjalankan SSG ini. Di balik layar, SSG biasanya membaca file markdown yang kita buat dan menjadikannya sebuah halaman HTML dan CSS.</p><p>Tenang saja kalau kamu kepikiran, seperti berarti saya harus selalu membuat header? footer? dan hal fix lainnya dong berkali-kali. Tenang, tidak perlu ko&#39; . Dengan SSG kita seperti membuat website dinamis sendiri. Kita menentukan template yang mau dipakai, tentu bisa kamu buat sendiri, sisanya kamu hanya perlu menambahkan kontennya.</p><p>Ada banyak &quot;apps&quot; yang menawarkan SSG termasuk dari berbagai macam bahasa dan framework. Kabar baiknya alurnya semua hampir sama, kita tidak perlu mempelajari bahasa tersebut untuk bisa mulai menggunakan SSG. Cukup dengan membaca panduan dokumentasinya. Yang normalnya hanya perlu membuat atau memilih template dan sudah bisa mulai membuat halamannya.</p><h2>Apa saja pilihan static site generator</h2><p>Cukup banyak, ada hugo, nuxtjs, nextjs, vuepress, gatsby, gridsome, jigsaw dan masih banyak lagi.</p><p>Orang biasanya memilih berdasarkan bahasa atau framework apa yang selama ini dia gunakan. Dimana nanti akan sangat membantu dalam mengembangkan websitenya.</p><h2>Kekurangan static site generator</h2><p>Diperlukan setup awal, normalnya teman-teman yang sebelumnya belum terbiasa dengan command prompt/ terminal akan merasa aneh, apalagi kalau malas membaca dokumentasi.</p><p>Untuk setiap penambahan halamannya pun akan butuh sedikit waktu lebih dibanding dengan website dinamis. Karena memerlukan &quot;build&quot; time dimana program akan melihat jika ada perubaha sedikitpun di halaman masing-masing dan membuat halamannya.</p><h2>Melengkapi Static Site Generator kamu</h2><p>Ada beberapa fitur yang kamu mungkin perlu memikirkan dua kali untuk menggunakan SSG ini. Tapi pelan-pelan sudah banyak produk yang mengatasi masalahnya.</p><p>Seperti</p><p><strong>membuat komentar</strong> kamu bisa menggunakan:</p><ul><li>disqus</li><li>commento</li><li>hyvor</li><li>talkyard</li><li>dll..</li></ul><p>menerima <strong>submisi form</strong> dengan:</p><ul><li>formspree</li><li>google form</li><li>formkeep</li></ul><p>melakukan autentikasi user:</p><ul><li>netlify go-true</li><li>Auth0</li></ul>"
      },
      {
        "title": "Deploy aplikasi Next.js kamu ke Forge.",
        "slug": "deploy-aplikasi-nextjs-kamu-ke-forge",
        "img": "https://laravel-blog-assets.s3.amazonaws.com/zJ8yJ6nFN2qsDhxvN0MeX7VBicXEvfzSldZ9Dkqg.png",
        "category": "Forge",
        "created_at": "2021-06-24",
        "body": "<p>Next.js adalah kerangka kerja React yang dikembangkan oleh Vercel. Ini mencakup fungsionalitas seperti rendering sisi server dan pembuatan situs statis. Hari ini kami akan menjelaskan bagaimana Anda dapat menerapkan aplikasi Next.js Anda dengan Laravel Forge.</p><p>Jika Anda mengikuti server Forge Anda sendiri, pastikan server tersebut adalah server &quot;Aplikasi&quot; atau &quot;Web&quot; sehingga Nginx diinstal.</p><p>Dalam postingan ini, kami akan menjelaskan cara men-deploy situs Anda menggunakan fitur rendering sisi server Next.js.</p><h2>Membuat Template Nginx</h2><p>Untuk menggunakan rendering sisi server, pertama-tama kita perlu membuat&nbsp;<a href=\"https://forge.laravel.com/docs/1.0/servers/nginx-templates.html\">Template Nginx</a> baru&nbsp;di Forge.&nbsp;Kami menggunakan Template Nginx di sini sehingga kami tidak perlu mengubah konfigurasi Nginx situs kami nanti.</p><p>Kami akan membuat template baru dengan nama &quot;Next.js App&quot; dan kemudian memperbarui konten template kami:</p><pre><code># FORGE CONFIG (DO NOT REMOVE!)\ninclude forge-conf/{{ SITE }}/before/*;\n\nserver {\n    listen {{ PORT }};\n    listen {{ PORT_V6 }};\n    server_name {{ DOMAINS }};\n    server_tokens off;\n    root {{ PATH }};\n\n    # FORGE SSL (DO NOT REMOVE!)\n    # ssl_certificate;\n    # ssl_certificate_key;\n\n    add_header X-Frame-Options &quot;SAMEORIGIN&quot;;\n    add_header X-XSS-Protection &quot;1; mode=block&quot;;\n    add_header X-Content-Type-Options &quot;nosniff&quot;;\n\n    index index.html index.htm;\n\n    charset utf-8;\n\n    # FORGE CONFIG (DO NOT REMOVE!)\n    include forge-conf/{{ SITE }}/server/*;\n\n    location / {\n        proxy_pass http://127.0.0.1:3000;\n    }\n\n    location = /favicon.ico { access_log off; log_not_found off; }\n    location = /robots.txt  { access_log off; log_not_found off; }\n\n    access_log off;\n    error_log  /var/log/nginx/{{ SITE }}-error.log error;\n\n    location ~ /\\.(?!well-known).* {\n        deny all;\n    }\n}\n\n# FORGE CONFIG (DO NOT REMOVE!)\ninclude forge-conf/{{ SITE }}/after/*;\n</code></pre><p>Anda mungkin memperhatikan bahwa&nbsp;<code>location /</code>blok tersebut menggunakan&nbsp;<code>proxy_pass</code>.&nbsp;Render sisi server di Berikutnya bekerja mirip dengan PHP, server membuat proses tetap berjalan yang menghasilkan konten dan menyajikannya ke klien.&nbsp;Dengan Next.js, kami menggunakan Node, jadi kami akan meneruskan permintaan kami ke server Next.js melalui port&nbsp;<code>3000</code>.&nbsp;Anda dapat mengubah ini berdasarkan persyaratan proyek Anda.</p><h2>Membuat Situs</h2><p>Dengan Template Nginx yang dibuat, sekarang kita dapat membuat situs kita, memastikan bahwa kita memilih opsi Template Nginx &quot;Next.js App&quot;:</p><p><img src=\"https://laravel-blog-assets.s3.amazonaws.com/tifX6Qp2JU3dW6f5AYzYqUHemwNYwaAEPG894Pya.png\" alt=\"Membuat situs baru\" class=\"fr-fic fr-dii\"></p><p>Setelah Forge membuat situs, kami dapat menginstal repositori kami dari penyedia Git pilihan kami.</p><h2>Skrip Penerapan</h2><p>Langkah selanjutnya adalah memperbarui skrip penerapan situs:</p><pre><code>cd /home/forge/next-app-static.curved-feather.test\ngit pull origin $FORGE_SITE_BRANCH\n\nnpm install\n</code></pre><p>Kami sekarang dapat menyebarkan situs kami dengan skrip yang diperbarui untuk menginstal dependensi NPM kami.</p><p>Jika kita menjelajah ke situs kita sekarang, Nginx akan memberi kita kesalahan 502.&nbsp;Ini karena kita belum memulai server Next.js.&nbsp;Untuk melakukannya, kita akan membuat Daemon baru di server.&nbsp;Untuk daemon, kita hanya perlu menyediakan direktori situs kita dan perintah;&nbsp;<code>npm run generate</code>.</p><p><img src=\"https://laravel-blog-assets.s3.amazonaws.com/ICmgY8IM74BmLj52RKHx0U0BIyCH5DLtr4UldXiW.png\" alt=\"Membuat Daemon\" class=\"fr-fic fr-dii\"></p><p>Setelah Daemon dikonfigurasi dan menjadi aktif, kita dapat mengunjungi situs kita dan melihat bahwa itu sekarang berfungsi.</p>"
      },
      {
        "title": "Memulai melangkah di dunia IT",
        "slug": "memulai-melangkah-di-dunia-it",
        "img": "https://i.ibb.co/c8zQQC0/photo-1481201779555-88fcea2968ca.jpg",
        "category": "Common",
        "created_at": "2021-06-09",
        "body": "<p id=\"isPasted\">Pertanyaan yang banyak ditanyakan ketika kita ingin berlajar di dunia IT. &quot;Harus Kemana ?&quot;. Semoga Tulisan dibawah bisa menjawab pertanyaan teman teman semua :D</p><p>Sebelum memulai, kita harus tau terlebih dahulu apa itu program?</p><p>Program atau Perangkat lunak atau Software adalah sekumpulan perintah untuk menyelesaikan suatu masalah tertentu.</p><p>Terus Apa sih pemrograman ?</p><p>Pemrograman itu adalah Proses pembuat, menambahkan, membangun, dan maintenance software suatu program.</p><p>Kemudian banyak yang bertanya tentang, siapa sih Programmer itu?</p><p>programmer adalah seseorang yg memiliki kemampuan merancang syntax menggunakan bahasa pemrograman.</p><p>Nah setelah tau dasar dasar dari semua itu, kemudian apa saja sih yang harus disiapkan sebelum mulai belajar pemrograman ?</p><p>Niat.</p><p>Tentu Semua gak akan jalan jika kita engga ada niat untuk mulai melangkah. Tapi ya</p><p>tentu saja ketika kamu baca artikel ini, pasti sudah ada niat untuk mulai melangkah di dunia IT 😌</p><p>Belajar Algoritma &amp; Struktur data.</p><p>Algoritma adalah langkah langkah atau tahapan untuk menyelesaikan suatu masalah secara logis dan terstruktur</p><p>Struktur data adalah bagaimana kita memanajemen sebuah data agar tidak memakan memori dan kinerja prosesor</p><p>Melatih belajar studi kasus.</p><p>Nah ini cara paling efektif untuk belajar. Coba tantang diri kamu belajar dari studi kasus, kamu akan terlatih bagaimana menyelesaikan masalah. Implementasikan Algoritma yang telah kamu pelajari.</p><p>Mau ngebuat apa nanti.</p><p>Nah, ini berkaitan dengan poin sebelumnya, kita harus tau tujuannya mau apa, contohnya mau buat website. Terus websitenya mau tentang apa ? dan mau pake teknologi apa disana.</p><p>laptop/pc sesuai kebutuhan.</p><p>Nah bisa diibaratkan Laptop atau PC itu kaya Pisau untuk seorang Chef, Chef tanpa pisau engga akan bisa menciptakan suatu produk. Begitu pula dengan IT. Kita mungkin masih bisa corat coret pakai kertas dan pulpen ketika ingin ngebuat Algoritma suatu program. Tapi tentunya tools yang kita gunakan engga cuma itu saja. Sebagai Programmer khususnya, setidaknya kita harus punya Laptop/PC.</p><p>Terus gimana jika kita yang engga punya laptop/pc ? Ini mungkin menjadi dilema kita sendiri. Namun perlu diingat, terkadang untuk meraih sesuatu harus mengorbankan sesuatu juga. Pertukaran setara. Ketika kita ingin berkembang lebih baik, kita harus mengeluarkan sedikit material.</p><p>Text Editor/IDE.</p><p>Ini yang menjadi alat &#39;perang&#39; kita setelah mempunyai laptop. Setiap chef tentu punya dapurnya masing masing, nah Programmer juga punya dapurnya! Namanya Text Editor dan IDE.</p><p>Apa itu Text Editor?</p><p>tools/ alat yang digunakan untuk mengolah code / source code kita, ukurannya terbilang kecil dan comfortable dengan banyak bahasa pemrograman.</p><p>Apa itu IDE?</p><p>Sama halnya dengan text Editor, namun memiliki Efisiensi dan fitur yang lebih banyak, dan biasanya digunakan untuk bahasa pemrograman tertentu dan ukurannya terbilang cukup besar dan berat</p><p>Memilih Dunia Pemrogramman.</p><p>Setelah semua alatnya sudah siap, Kita harus menentukan dunia pemrograman apa yang akan di perdalam untuk menyelesaikan masalah/studikasus kita. Pertanyaanya adalah Mau kemana ?</p><p>Ada banyak Dunia IT itu. mungkin saya hanya akan menyebutkan beberapa saja.</p><ul><li>Ada Dunia Web =&gt; Dunia dimana kamu akan berinteraksi banyak hal dengan internet dan website.</li><li>Ada Dunia Desktop =&gt; Dunia dimana kamu akan membuat aplikasi aplikasi GUI di desktop.</li><li>Ada Dunia Mobile =&gt; Dunia Smartphone! Kamu akan ngebuat aplikasi Mobile.</li><li>Ada Dunia AI =&gt; Dunia Kecerdasan Buatan/Artificial Intelligence. Dunia dimana kamu akan buat robot pintar! Machine Learning! dan banyak lagi.</li></ul><p>4 Dunia ini yang sekarang lagi rame dibicarakan. Dan tentunya semakin rame dibicarakan, maka persaingannya makin rame juga.</p><p>Mental Programmer.</p><p>Terakhir dan paling fatal menurut saya. Mental. Sebagai programmer kita harus terlatih untuk sabar menghadapi &#39;cobaan&#39;. Bagaimana menghadapi bug, bagaimana menghadapi persaingan antar programmer, bagaimana menghadapi dunia kerja nanti, atau bahkan bagaimana menghadapi client yang rewel.</p><p>Mental harus siap setiap saat. Kita harus kuat ditempa banyak masalah. Logika Algoritma kita akan di asah disini. Menyelesaikan semuanya secara efisien dan diusahakan tidak menimbulkan masalah lain.</p><p>Kesimpulan</p><p>Sebelum melangkah, kita harus tau step by step untuk memulai sesuatu. Sangat panjang sekali memang. Namun kita harus melalui semua itu. Tetap menjadi Programmer yang semangat belajar, Mental yang kuat dan Berfikir se efisien mungkin.</p>"
      },
      {
        "title": "Vapor: Redis 6.x Cluster Sekarang Tersedia",
        "slug": "vapor-redis-6x-cluster-sekarang-tersedia",
        "img": "https://laravel-blog-assets.s3.amazonaws.com/pBgZmYBs1XRDVDMptC2A2MUK9eXGSlvljrso5gTv.png",
        "category": "Vapor",
        "created_at": "2021-05-04",
        "body": "<p id=\"isPasted\">Vapor memungkinkan Anda dengan mudah membuat dan mengelola Redis Cache Cluster yang dapat diskalakan langsung dari UI Vapor atau menggunakan CLI Vapor.&nbsp;Mulai hari ini, selain Redis 5.x Cluster,&nbsp;<strong>kini Anda juga dapat membuat dan mengelola Redis 6.x Cluster</strong> .</p><p>Redis 6.x adalah versi terbaru dari&nbsp;perangkat lunak&nbsp;sumber terbuka&nbsp;<a href=\"https://redis.io/\">Redis</a> .&nbsp;Versi baru ini menghadirkan peningkatan keamanan dan meningkatkan kinerja cache Anda.</p><p>Anda dapat mulai menggunakan Redis 6.x Clusters dengan membuat cache baru di Vapor UI atau menggunakan&nbsp;<code>cache</code>perintah CLI.&nbsp;Kedua cara akan meminta Anda untuk detail lebih lanjut tentang cache seperti versi Redis:</p><p><img src=\"https://laravel-blog-assets.s3.amazonaws.com/pBgZmYBs1XRDVDMptC2A2MUK9eXGSlvljrso5gTv.png\" alt=\"gambar\" class=\"fr-fic fr-dii\"></p><p>Silakan lihat&nbsp;<a href=\"https://aws.amazon.com/blogs/aws/new-redis-6-compatibility-for-amazon-elasticache/\">pengumuman blog AWS</a> untuk informasi lebih lanjut tentang fitur baru ini.</p><p>Kami harap Anda menikmati tambahan baru untuk Laravel Vapor ini.&nbsp;Di Laravel, kami berkomitmen untuk memberi Anda pengalaman PHP yang paling kuat dan ramah pengembang di dunia.&nbsp;Jika Anda belum memeriksa Vapor, sekarang adalah waktu yang tepat untuk memulai!&nbsp;Anda dapat membuat akun hari ini di:&nbsp;<strong><a href=\"https://vapor.laravel.com/\">vapor.laravel.com</a></strong> .</p>"
      },
      {
        "title": "Vapor: Redis 6.x Cluster Sekarang Tersedia",
        "slug": "vapor-redis-6x-cluster-sekarang-tersedia",
        "img": "https://laravel-blog-assets.s3.amazonaws.com/pBgZmYBs1XRDVDMptC2A2MUK9eXGSlvljrso5gTv.png",
        "category": "Vapor",
        "created_at": "2021-05-04",
        "body": "<p id=\"isPasted\">Vapor memungkinkan Anda dengan mudah membuat dan mengelola Redis Cache Cluster yang dapat diskalakan langsung dari UI Vapor atau menggunakan CLI Vapor.&nbsp;Mulai hari ini, selain Redis 5.x Cluster,&nbsp;<strong>kini Anda juga dapat membuat dan mengelola Redis 6.x Cluster</strong> .</p><p>Redis 6.x adalah versi terbaru dari&nbsp;perangkat lunak&nbsp;sumber terbuka&nbsp;<a href=\"https://redis.io/\">Redis</a> .&nbsp;Versi baru ini menghadirkan peningkatan keamanan dan meningkatkan kinerja cache Anda.</p><p>Anda dapat mulai menggunakan Redis 6.x Clusters dengan membuat cache baru di Vapor UI atau menggunakan&nbsp;<code>cache</code>perintah CLI.&nbsp;Kedua cara akan meminta Anda untuk detail lebih lanjut tentang cache seperti versi Redis:</p><p><img src=\"https://laravel-blog-assets.s3.amazonaws.com/pBgZmYBs1XRDVDMptC2A2MUK9eXGSlvljrso5gTv.png\" alt=\"gambar\" class=\"fr-fic fr-dii\"></p><p>Silakan lihat&nbsp;<a href=\"https://aws.amazon.com/blogs/aws/new-redis-6-compatibility-for-amazon-elasticache/\">pengumuman blog AWS</a> untuk informasi lebih lanjut tentang fitur baru ini.</p><p>Kami harap Anda menikmati tambahan baru untuk Laravel Vapor ini.&nbsp;Di Laravel, kami berkomitmen untuk memberi Anda pengalaman PHP yang paling kuat dan ramah pengembang di dunia.&nbsp;Jika Anda belum memeriksa Vapor, sekarang adalah waktu yang tepat untuk memulai!&nbsp;Anda dapat membuat akun hari ini di:&nbsp;<strong><a href=\"https://vapor.laravel.com/\">vapor.laravel.com</a></strong> .</p>"
      },
      {
        "title": "Forge: Octane Support",
        "slug": "forge-octane-support",
        "img": "https://laravel-blog-assets.s3.amazonaws.com/387iQVEFLGWQ8GGBk30sCKZpVY4IyVZiYTZhISkU.jpeg",
        "category": "Forge",
        "created_at": "2021-04-21",
        "body": "<p>Kembali pada bulan Maret, Taylor mengumumkan proyek <a href=\"https://github.com/laravel/octane\">Laravel Octane</a> baru di Laracon Online.&nbsp;Sejak itu, kami sibuk mengerjakan perbaikan bug dan peningkatan pada Octane, serta menambahkan dukungan ke&nbsp;<a href=\"https://forge.laravel.com/\">Laravel Forge</a> .</p><p><img alt=\"\" src=\"https://laravel-blog-assets.s3.amazonaws.com/NmYMPJw14ZDIXLIqJeE9LUifABZ89AEMP5brhMwb.png\" class=\"fr-fic fr-dii\"></p><p>Hari ini kami dengan senang hati mengumumkan bahwa dukungan Octane tersedia di Forge.&nbsp;Kami telah menulis panduan di bawah ini untuk membantu Anda memulai.&nbsp;Harap diingat bahwa Octane masih dalam versi beta dan tidak boleh digunakan dalam produksi.</p><h2>Prasyarat</h2><p>Proyek Anda harus membutuhkan&nbsp;<code>&quot;laravel/octane&quot;: &quot;^0.3.2&quot;</code>atau lebih tinggi.&nbsp;Server Anda&nbsp;<strong>harus</strong> menginstal PHP 8.0.</p><p>Anda kemudian harus mengikuti instruksi instalasi Octane yang terdaftar di&nbsp;<a href=\"https://github.com/laravel/octane#installation\">repositori Octane</a> .</p><h2>Membuat Situs Oktan</h2><p>Octane dapat diaktifkan dengan memilih&nbsp;opsi jenis proyek&nbsp;<strong>Laravel Octane (Beta)</strong> dan PHP 8.0 sebagai versi PHP yang harus digunakan untuk melayani situs Anda:</p><p><img alt=\"Jenis Proyek Laravel Octane\" src=\"https://laravel-blog-assets.s3.amazonaws.com/b2Qk8heidCP5AzCNlaFIdf7JDJBtcxRP80kEiOSY.png\" class=\"fr-fic fr-dii\"></p><p>Jenis Proyek Laravel Octane</p><p>Setelah jenis proyek dipilih, Forge akan meminta port yang harus didengarkan oleh Octane.</p><p>Tidak seperti jenis proyek lainnya, Octane tidak akan menggunakan PHP-FPM untuk melayani situs Anda.&nbsp;Sebagai gantinya, Octane memulai server RoadRunner atau Swoole-nya sendiri (pilihan Anda) dan menggunakan Nginx sebagai proxy terbalik ke port yang Anda pilih.&nbsp;Sebaiknya pilih nomor port yang tinggi&nbsp;<code>8000</code>untuk mencegah bentrokan dengan perangkat lunak lain yang mungkin berjalan di server Anda.</p><p>Saat membuat situs Anda, Forge akan menginstal ekstensi Swoole jika belum diinstal di server Anda.&nbsp;Semua server baru yang disediakan dengan PHP 8.0 akan secara otomatis menerima ekstensi ini.</p><h2>Mengonfigurasi Daemon Oktan</h2><p>Setelah situs bertenaga Octane Anda dibuat di Forge, Anda akan melihat dua perbedaan penting dibandingkan dengan proyek FPM standar:</p><ol><li>Deploy Script tidak memuat ulang PHP-FPM, melainkan akan memeriksa status server Octane dan mengeluarkan perintah reload ke server Octane.</li><li>Ada&nbsp;panel&nbsp;<strong>Laravel Octane (Beta) baru</strong> yang menampilkan informasi yang Anda perlukan untuk mengonfigurasi daemon dengan benar.</li></ol><p><img alt=\"Forge akan menampilkan informasi yang diperlukan untuk membuat Daemon baru Anda.\" src=\"https://laravel-blog-assets.s3.amazonaws.com/55yqMNcF4ll3xMi099KwXSaW0hnJPqhibwCKM9Gu.png\" class=\"fr-fic fr-dii\"></p><p>Forge akan menampilkan informasi yang diperlukan untuk membuat Daemon baru Anda.</p><p>Anda harus menggunakan informasi ini untuk membuat Daemon yang akan mengelola server Octane Anda.&nbsp;Karena server Octane adalah proses yang berjalan lama, Daemon akan memantau proses dan secara otomatis memulai ulang Octane jika crash:</p><p><img alt=\"Membuat Daemon baru untuk menjalankan Octane.\" src=\"https://laravel-blog-assets.s3.amazonaws.com/pORInQL0ykdW0vc2A9U2tjYUruZjbkkq94zLAzjX.png\" class=\"fr-fic fr-dii\"></p><p>Membuat Daemon baru untuk menjalankan Octane.</p><p>Mari kita cepat memecah perintah yang telah dibuat Forge untuk kita:</p><pre>php8.0 artisan oktan: mulai  --port=8000 --tidak ada interaksi</pre><ul><li>Kami memastikan bahwa&nbsp;<code>octane:start</code>berjalan dengan biner PHP 8.0.</li><li>Kami memberi tahu Octane untuk mendengarkan di port&nbsp;<code>8000</code>.</li><li>Kami menjalankan perintah dengan&nbsp;<code>--no-interaction</code>opsi sehingga Octane akan menginstal dependensi apa pun untuk kami seperti&nbsp;<code>rr</code>(biner RoadRunner) jika perlu.</li></ul><p>Setelah Daemon Anda dibuat, situs Octane Anda sekarang seharusnya dapat diakses melalui browser web Anda!</p><p>Jika Anda tidak memiliki &nbsp; akun&nbsp;<a href=\"https://forge.laravel.com/\">Forge</a> , sekarang adalah saat yang tepat untuk mendaftar! Forge memungkinkan Anda membuat dan mengelola server PHP dengan mudah yang mencakup MySQL, Redis, Memcached, cadangan basis data, dan semua yang Anda perlukan untuk menjalankan aplikasi Laravel modern yang tangguh.</p>"
      },
      {
        "title": "Hugo, framework untuk membuat website statis",
        "slug": "hugo-framework-untuk-membuat-website-statis",
        "img": "https://i.ibb.co/wKhdpK5/Screen-Shot-2020-08-15-at-8-58-53-AM.png",
        "category": "SSG",
        "created_at": "2021-04-15",
        "body": "<p>Ada banyak perlombaan di dunia &quot;static site generator&quot;, salah satu yang sangat populer adalah <a href=\"https://gohugo.io/\">hugo</a>, dengan &quot;jualan&quot; utama di landing pagenya &quot;the world&#39;s fastest framework for building websites&quot; atau diterjemahkan &quot;framework tercepat di dunia untuk membuat website&quot;. Normalnya saya akan bilang, setiap framework pasti punya klaimnya masing-masing, tapi setelah saya menggunakannya, ternyata hugo berhasil membuktikan janjinya! sangat cepat!</p><p>Kita berkenalan dulu sedikit tentang hugo dan fitur apa saja yang dia punya, sebelum kita lompat ke cara membuat websitenya.</p><h2>Apa itu Hugo</h2><p>Hugo adalah proyek open source yang dimulai oleh Bj&oslash;rn Erik Pedersen yang saat ini sudah disponsori oleh banyak perusahaan. Tidak mudah tentunya untuk sebuah proyek open source bisa sampai ke tahap tersebut. Ini menjadi salah satu bukti, kalau banyak orang yang sudah terbantu dengan Hugo.</p><p>Dibuat dengan <a href=\"https://sekolahkoding.com/belajar/go-lang\">bahasa Go Lang</a> , bahasa modern yang terkenal dengan kecepatannya, hugo akan membantu kamu membuat website statis tanpa perlu menunggu lama dalam waktu <em>build</em>-nya.</p><h2>Apa yang bisa dibuat dengan Hugo</h2><p>Seperti membuat blog pada platform besar seperti wordpress, kamu bisa melakukan banyak hal di sini. Seperti sistem kategori, menu dinamis, mengurus SEO dan masih banyak lagi. Karena itu membuat website dengan Hugo akan terasa sangat fleksibel seperti membuat website dengan bahasa dinamis lainnya.</p><p>Seperti <a href=\"https://sekolahkoding.com/artikel/apa-itu-static-site-generator\">SSG(static site generator)</a> pada umumnya, pengguna bisa menggunakan markdown saat ingin menulis kontennya, sayangya markdown dikenal memiliki beberapa keterbatasan, seperti tidak bisa memasukkan iframe. Hugo mengatasi ini dengan fitur &quot;shortcodes&quot; nya, di mana ada beberapa kode yang sudah disediakan dan bisa kita buat sendiri untuk dimasukkan ke markdownnya. Seperti menampilkan iframe, tag figure pada HTML, embed konten sosial media, dan lainnya.</p><p>Kamu juga bisa mengambil konten dari file JSON dengan Hugo jika kamu membutuhkannya.</p><h2>Bagaimana cara install Hugo</h2><p>Hugo bisa digunakan di semua OS pada umumnya seperti: macOS, Windows, Linux, OpenBSD, FreeBSD.</p><p><strong>MacOS dan Linux</strong></p><p>bisa menggunakan package manager <a href=\"https://brew.sh/\">homebrew</a></p><pre>brew install hugo</pre><p><strong>Windows</strong></p><p>menggunakan package manager <a href=\"https://chocolatey.org/\">chocolatey</a></p><pre>choco install hugo -confirm</pre><p>atau menggunakan <a href=\"https://scoop.sh/\">scoop</a></p><pre>scoop install hugo</pre><p>Jika sudah menginstall, kamu bisa konfirmasi berhasil dengan mengetik <code>hugo version .</code></p><p>Jika sudah ada output yang terlihat, berarti instalannya berhasil.</p><p>Ini informasi lengkap <a href=\"https://gohugo.io/getting-started/installing/\">cara install hugo</a></p><h2>Membuat website dengan Hugo</h2><p>Langsung saja cara membuat website baru dengan hugo</p><pre>hugo new site namaProyekMu</pre><p>Perintah di atas akan membuat proyek/folder baru sesuai nama yang kamu masukkan. Silahkan buka text editor untuk melihat instalan dari Hugo.</p><h2>Membuat halaman baru di Hugo</h2><p>Untuk membuat halaman baru di websitemu</p><pre>hugo new posts/post-pertama.md</pre><p>Ini isi dari file tersebut. Kamu bisa mulai menulis postingan di bawah baris yang sudah ada.</p><pre>---\ntitle: &quot;Post Pertama&quot;\ndate: 2020-08-15T09:44:10+08:00\ndraft: true\n---\n\nIni tambahan dari kamu.\nIni halaman pertama.</pre><p>Kamu berhasil membuat satu halaman baru yang lokasinya ada di dalam folder content/posts.</p><p>Baris --- adalah informasi dari file tersebut, yang bisa berisi banyak hal. Pada kasus ini adalah judul dari kontennya, tanggal dibuat dan apakah dia draft atau bukan. Draft berarti kontennya hanya bisa terlihat oleh kamu (pembuatnya).</p><p>Kamu bisa mempublishnya dengan mengganti nilai draft menjadi false.</p><pre>---\ntitle: &quot;Post Pertama&quot;\ndate: 2020-08-15T09:44:10+08:00\ndraft: false\n---</pre><h2>Memberikan Tema Hugo</h2><p>Saat ini website kamu belum punya tema atau template dasar yang bisa kamu lihat. Untuk itu kamu membutuhkan <a href=\"https://git-scm.com/\">git</a> jika belum menginstallnya.</p><pre>git init\ngit submodule add <a href=\"https://github.com/budparr/gohugo-theme-ananke.git\">https://github.com/budparr/gohugo-theme-ananke.git</a> themes/ananke</pre><p>Penjelasan perintah:</p><p><em>git init</em></p><p>Di sini kita menginsialisasi repo baru. Agar bisa mengampil tema berdasarkan link git nya</p><p><em>git submodule add ..</em></p><p>Kita mengimport tema baru bernama &quot;ananke&quot;. Ada banyak pilihan tema Hugo yang bisa kamu ambil di <a href=\"https://themes.gohugo.io/\">themes Hugo</a> . Kamu tinggal memilih salah satunya dan mengganti link repo github di atas berdasarkan info tema masing-masing.</p><p>Di bawah folder &quot;themes&quot; kamu sekarang, sudah banyak informasi mengenal tema tersebut.</p><p>Beritahu website kamu untuk menggunakan tema ini dengan menambahkan</p><p><code>theme = &quot;ananke&quot;&nbsp;</code>di file config.toml kamu</p><p>atau cukup jalankan</p><pre>echo &#39;theme = &quot;ananke&quot;&#39; &gt;&gt; config.toml</pre><h2>Menjalankan server Hugo</h2><p>Sekarang kita jalankan website kamu.</p><pre>hugo server</pre><p>Website kamu sudah jadi! silahkan intip di <a href=\"http://localhost:1313/\">http://localhost:1313/</a> atau baca output dari command tersebut tentang informasi lokasi localhost kamu</p><p><img src=\"https://i.ibb.co/qx8bTVC/Screen-Shot-2020-08-15-at-10-26-14-AM.png\" alt=\"Screen-Shot-2020-08-15-at-10-26-14-AM.png\" class=\"fr-fic fr-dii\"><em>Screen Shot 2020-08-15 at 10.26.14 AM.png</em></p><p><br></p><p>Tulisa &quot;my new hugo site&quot; tersebut adalah judul standar yang ada di file config.toml yang bisa kamu ganti sendiri di config.toml bagian <code>title=&quot;judul website kamu&quot;</code></p><p>Kalau kamu mau menampilkan konten yang masih dalam bentuk draft cukup menambahkan -D</p><pre>hugo server -D</pre><h2>Bagaimana cara mengganti tema Hugo</h2><p>Kamu bosan atau menyesal dengan pilihan tema hugo kamu? Tenang dia ngga YOLO ko, alias cuma bisa satu kali. Kamu bisa kembali ke daftar tema <a href=\"https://themes.gohugo.io/\">themes Hugo</a> dan melakukan hal yang sama seperti sebelumnya.</p><p>Cukup copy paste command git submodule salah satu temanya untuk menginstall.</p><p>Kalau sudah berhasil di folder <code>themes</code> kamu sekarang sudah ada lebih dari satu tema.</p><p>Untuk menggantinya sendiri tinggal ke file konfigurasi config.toml dan mengganti nilai <code>theme = &quot;nama tema pilihan kamu&quot;</code></p><p>Kita akan bermain lagi dengan Hugo di artikel lainnya!</p><p><em>Meta: bagaimana cara install Hugo SSG, apa itu Hugo, cara membuat blog dengan Hugo, cara membuat webiste statis dengan Hugo</em></p>"
      }
    ]
  }
}
